app/controllers/tweeets_controller.rb

  def index
    @tweeets = Tweeet.all.order("created_at DESC")
---
SELECT "tweeets".* FROM "tweeets" ORDER BY created_at DESC

  def create
    @tweeet = current_user.tweeets.build(tweeet_params)

    respond_to do |format|
      if @tweeet.save
---
INSERT INTO "tweeets" ("tweeet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweeet", "This is my first morning tweet"], ["created_at", "2020-05-10 04:44:23.394284"], ["updated_at", "2020-05-10 04:44:23.394284"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @tweeet.update(tweeet_params)
---
UPDATE "tweeets" SET "tweeet" = ?, "updated_at" = ? WHERE "tweeets"."id" = ?  [["tweeet", "Hello from the class ldfjaslfdj "], ["updated_at", "2020-05-13 19:32:28.876955"], ["id", 6]]

  def destroy
    @tweeet.destroy
---
DELETE FROM "tweeets" WHERE "tweeets"."id" = ?  [["id", 3]]

    def set_tweeet
      @tweeet = Tweeet.find(params[:id])
---
SELECT "tweeets".* FROM "tweeets" WHERE "tweeets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]